# Pandas

## Dataset on Python

- How to create 2 Numpy array but one data type ? Here comes Pandas
- Tools for manipulating data
- Based on Numpy
- DataFrame

In [2]:
countries = {
    "name": ["Swiss", "Indonesia", "India", "USA", "Russia"],
    "capital": ["Bern", "Jakarta", "New Delhi", "Washington D.C.", "Moscow"],
    "population": [8.545, 267.7, 1353, 382.2, 144.5]
}

In [3]:
import pandas as pd

In [4]:
countries_df = pd.DataFrame(countries)

In [5]:
countries_df

        name          capital  population
0      Swiss             Bern       8.545
1  Indonesia          Jakarta     267.700
2      India        New Delhi    1353.000
3        USA  Washington D.C.     382.200
4     Russia           Moscow     144.500

What shown :
- Column lable
- Row lable
- Variable
- Observation

In [6]:
countries_df.index = ["CHE", "ID", "IN", "US", "RUS"]

In [7]:
countries_df

          name          capital  population
CHE      Swiss             Bern       8.545
ID   Indonesia          Jakarta     267.700
IN       India        New Delhi    1353.000
US         USA  Washington D.C.     382.200
RUS     Russia           Moscow     144.500

## Create DataFrame from CSV file

In [12]:
df = pd.read_csv('countries.csv')

In [13]:
df

  code       name          capital  population
0  CHE      Swiss             Bern       8.545
1   ID  Indonesia          Jakarta     267.700
2   IN      India        New Delhi    1353.000
3   US        USA  Washington D.C.     382.200
4  RUS     Russia           Moscow     144.500

In [14]:
df = pd.read_csv('countries.csv', index_col=0)

In [15]:
df

           name          capital  population
code
CHE       Swiss             Bern       8.545
ID    Indonesia          Jakarta     267.700
IN        India        New Delhi    1353.000
US          USA  Washington D.C.     382.200
RUS      Russia           Moscow     144.500

## DataFrame loc
loc means location to select only one or some row

In [16]:
df.loc['ID']

name          Indonesia
capital         Jakarta
population        267.7
Name: ID, dtype: object

In [17]:
df.loc[['ID']]

           name  capital  population
code
ID    Indonesia  Jakarta       267.7

## DataFrame iloc
iloc means index location

In [18]:
df.iloc[2]

name              India
capital       New Delhi
population         1353
Name: IN, dtype: object

In [19]:
df.iloc[[2]]

       name    capital  population
code
IN    India  New Delhi      1353.0

## Filtering Data

In [20]:
df['population'] > 300

code
CHE    False
ID     False
IN      True
US      True
RUS    False
Name: population, dtype: bool

In [21]:
big_population = df['population'] > 300

In [22]:
df[big_population]

       name          capital  population
code
IN    India        New Delhi      1353.0
US      USA  Washington D.C.       382.2